eshjordan/stm32-ecu/CM4/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "openamp.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32mp15xx_disco.h"

#include "stm32System.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
typedef StaticTask_t osStaticThreadDef_t;
typedef StaticTimer_t osStaticTimerDef_t;
typedef StaticSemaphore_t osStaticMutexDef_t;
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
 CRC_HandleTypeDef hcrc2;

FDCAN_HandleTypeDef hfdcan1;

I2C_HandleTypeDef hi2c1;

IPCC_HandleTypeDef hipcc;

RNG_HandleTypeDef hrng2;

SPI_HandleTypeDef hspi4;
SPI_HandleTypeDef hspi5;
DMA_HandleTypeDef hdma_spi5_rx;
DMA_HandleTypeDef hdma_spi5_tx;

UART_HandleTypeDef huart4;

/* Definitions for ledAlive */
osThreadId_t ledAliveHandle;
uint32_t ledAliveBuffer[ 256 ];
osStaticThreadDef_t ledAliveControlBlock;
const osThreadAttr_t ledAlive_attributes = {
  .name = "ledAlive",
  .cb_mem = &ledAliveControlBlock,
  .cb_size = sizeof(ledAliveControlBlock),
  .stack_mem = &ledAliveBuffer[0],
  .stack_size = sizeof(ledAliveBuffer),
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for linuxComms */
osThreadId_t linuxCommsHandle;
uint32_t linuxCommsBuffer[ 128 ];
osStaticThreadDef_t linuxCommsControlBlock;
const osThreadAttr_t linuxComms_attributes = {
  .name = "linuxComms",
  .cb_mem = &linuxCommsControlBlock,
  .cb_size = sizeof(linuxCommsControlBlock),
  .stack_mem = &linuxCommsBuffer[0],
  .stack_size = sizeof(linuxCommsBuffer),
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for esp_in_update_tmr */
osTimerId_t esp_in_update_tmrHandle;
osStaticTimerDef_t esp_in_update_tmrControlBlock;
const osTimerAttr_t esp_in_update_tmr_attributes = {
  .name = "esp_in_update_tmr",
  .cb_mem = &esp_in_update_tmrControlBlock,
  .cb_size = sizeof(esp_in_update_tmrControlBlock),
};
/* Definitions for esp_out_update_tmr */
osTimerId_t esp_out_update_tmrHandle;
osStaticTimerDef_t esp_out_update_tmrControlBlock;
const osTimerAttr_t esp_out_update_tmr_attributes = {
  .name = "esp_out_update_tmr",
  .cb_mem = &esp_out_update_tmrControlBlock,
  .cb_size = sizeof(esp_out_update_tmrControlBlock),
};
/* Definitions for esp32DataMutex */
osMutexId_t esp32DataMutexHandle;
osStaticMutexDef_t esp32DataMutexControlBlock;
const osMutexAttr_t esp32DataMutex_attributes = {
  .name = "esp32DataMutex",
  .cb_mem = &esp32DataMutexControlBlock,
  .cb_size = sizeof(esp32DataMutexControlBlock),
};
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_IPCC_Init(void);
static void MX_DMA_Init(void);
static void MX_SPI5_Init(void);
static void MX_RNG2_Init(void);
static void MX_I2C1_Init(void);
static void MX_UART4_Init(void);
static void MX_CRC2_Init(void);
static void MX_FDCAN1_Init(void);
static void MX_SPI4_Init(void);
int MX_OPENAMP_Init(int RPMsgRole, rpmsg_ns_bind_cb ns_bind_cb);
void ledAliveRunner(void *argument);
extern void runLinuxComms(void *argument);
extern void esp_in_update(void *argument);
extern void esp_out_update(void *argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  if(IS_ENGINEERING_BOOT_MODE())
  {
    /* Configure the system clock */
    SystemClock_Config();
  }

  if(IS_ENGINEERING_BOOT_MODE())
  {
    /* Configure the peripherals common clocks */
    PeriphCommonClock_Config();
  }
  else
  {
    /* IPCC initialisation */
     MX_IPCC_Init();
    /* OpenAmp initialisation ---------------------------------*/
    MX_OPENAMP_Init(RPMSG_REMOTE, NULL);
  }

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI5_Init();
  MX_RNG2_Init();
  MX_I2C1_Init();
  MX_UART4_Init();
  MX_CRC2_Init();
  MX_FDCAN1_Init();
  MX_SPI4_Init();
  /* USER CODE BEGIN 2 */
#if (USE_BSP_COM_FEATURE == 1U)
	COM_InitTypeDef COM_Init = { .BaudRate = 115200,
				     .WordLength = 8,
				     .StopBits = COM_STOPBITS_1,
				     .Parity = COM_PARITY_NONE,
				     .HwFlowCtl = COM_HWCONTROL_NONE };
	BSP_COM_Init(COM1, &COM_Init);
#endif
  /* USER CODE END 2 */

